saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32630.0.0.1.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32630</name>
   <url>http://mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32630 and MAX32631 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>
      <release version="0.2.7-b" date="2018-01-18">
         Initial release for public usage.
         - IAR Support Added
         - Keil uVision Support Added
      </release>
      <release version="0.2.7-b" date="2018-01-18">
         Initial release for public usage.
         - IAR Support Added
         - Keil uVision Support Added
      </release>
      <release version="0.2.7-b" date="2017-02-01">
         First MAX3263X pack file release
      </release>
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32631</keyword>
      <keyword>MAX32630</keyword>
      <keyword>MAX32630 Evaluation Kit</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <packages>
         <package name="CMSIS" vendor="ARM" version="4.1.0:4.5.0" />
      </packages>
      <compilers>
         <compiler name="ARMCC" version="5.0.0:5.99.0" />
      </compilers>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>

   <devices>

      <family Dfamily="MAX32630" Dvendor="Maxim:23">
         <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         <compile header="Libraries/Device/Maxim/MAX3263X/Include/max3263x.h" />
         <debug svd="SVD/MAX32630/max3263x.svd" />
         <description>
           The MAX32630 device family is designed for wearable and portable medical and fitness applications. The devices contain an ARM Cortex-M4 processor with FPU, execute up to 96MHz and include a 10-bit ADC and a versatile set of on-chip peripherals.
         </description>
         <book name="http://infocenter.arm.com/help/topic/com.arm.doc.dui0553a/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
         <book name="Documents/MAX32630_DS.pdf" title="MAX32630 Datasheet"/>
         <book name="Documents/MAX32630_User_Guide.pdf" title="MAX32630 User Guide"/>

         <feature type="Timer" n="12" m="16" name="32-Bit Timers reconfigurable as 2x16-Bit Timers"/>
         <feature type="Timer" n="6" m="32"/>
         <feature type="DMA" n="6" name="Peripheral Managment Unit"/>
         <feature type="IOs" n="49"/>
         <feature type="WDT" n="3"/>
         <feature type="RTC" n="32768"/>
         <feature type="ADC" n="10" m="10" name="Sigma-Delta ADC, 7.8ksps, Two 5.5V tolerant inputs, Two 1.2V tolerant inputs"/>
         <feature type="TimerOther" n="16" name="Channel Pulse Train Engine"/>
         <feature type="SDIO" n="3" m="4" name="x1, x2 and x4 SDIO Interface"/>
         <feature type="SPI" n="3" m="24000000" name="3 SPI Masters"/>
         <feature type="SPI" n="1" m="24000000" name="1 SPI Slave"/>
         <feature type="ExtBus" n="4" name="SPI XiP at up to 24MHz for memory expansion"/>
         <feature type="I2C" n="3" name="3 I2C Masters"/>
         <feature type="I2C" n="1" name="1 I2C Slave"/>
         <feature type="UART" n="4" m="115200"/>
         <feature type="ComOther" n="1" name="1-Wire Master"/>
         <feature type="USBD" n="1" name="Full-Speed USB Device"/>
         <feature type="VCC" n="1.2" name="Core Supply Voltage"/>
         <feature type="VCC" n="1.8" m="3.6" name="1.8V - 3.6V VDD with I/O Supply Selectable Between 1.8V and 3.6V"/>
         <feature type="Temp" n="-40" m="85"/>
         <feature type="PowerMode" n="4" name="LP3 Run, LP2 PMU, LP1 Standby, LP0 Stop"/>
         <feature type="CoreOther" n="1" name="CRC Calculation Unit"/>
         <feature type="ClockOther" n="96000000" name="Internal Relaxation Oscillator with +/- 1% accuracy"/>
         <feature type="ClockOther" n="4000000" name="Low Power 4MHz Internal Ring Oscillator"/>
         <feature type="Crypto" n="128.256" name="128/256-bit Hareware Accelerated AES Encryption Engine"/>

         <device Dname="MAX32630">
            <processor Dclock="96000000"/>
            <debugconfig default="jtag" clock="1000000" swj="1"/>
            <compile header="Libraries/Device/Maxim/MAX3263X/Include/max3263x.h"/>
            <debug svd="SVD/MAX32630/max3263x.svd"/>
            <algorithm name="Flash/MAX32630.FLM" start="0x00000000" size="0x00200000" default="1"/>
            <memory id="IROM1" access="rwx" start="0x00000000" size="0x00200000" startup="1" default="1"/>
            <memory id="IRAM1" access="rwx" start="0x20000000" size="0x00080000" init="0" default="1"/>
         </device>

         <device Dname="MAX32631">
            <processor Dclock="96000000"/>
            <debugconfig default="jtag" clock="1000000" swj="1"/>
            <compile header="Libraries/Device/Maxim/MAX3263X/Include/max3263x.h"/>
            <debug svd="SVD/MAX32630/max3263x.svd"/>
            <algorithm name="Flash/MAX32630.FLM" start="0x00000000" size="0x00200000" default="1"/>
            <memory id="IROM1" access="rx" start="0x00000000" size="0x00200000" startup="1" default="1"/>
            <memory id="IRAM1" access="rwx" start="0x20000000" size="0x00080000" init="0" default="1"/>
            <feature type="RNG" n="1" name="Random Seed Generator"/>
            <feature type="Crypto" n="128.256" name="AES hardware accelerator"/>
            <feature type="Crypto" n="1024.2048" name="Modulo Arithmetic Accelerator (MAA) with up to 1024-bit DSA/ECDSA, 2048-bit (CRT) RSA"/>
         </device>

      </family>

   </devices>

   <boards>
      <board vendor="Maxim" name="MAX32630_EVKIT" revision="REV 3.0" salesContact="sales@maximintegrated.com" orderForm="http://www.maximintegrated.com/MAX32630">
         <description>The MAX32630 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32630 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications. This Evaluation Kit supports both the MAX32630 and the MAX32631 (Trust Protection Unit (TPU) enabled).
         </description>
         <image small="Images/MAX32630_EVKIT_Small.jpg" large="Images/MAX32630_EVKIT_Large.jpg"/>
         <book category="manual" name="Documents/MAX32630_EVKIT_Datasheet.pdf" title="Evaluation Kit Datasheet and Configuration"/>
         <book category="schematic" name="Documents/MAX32630_EVKIT_Datasheet.pdf" title="Schematic"/>
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32630"/>
         <compatibleDevice Dvendor="Maxim:23" Dfamily="MAX32630"/>
         <feature type="PWR" n="3.3" m="5.5"/>
         <feature type="Proto" n="13" m="11" name="13 x 11 Prototyping Area with one row connected to 1.8V PWR, one row connected to 3.3V PWR and one row connected to GND"/>
         <feature type="Memory" n="16" name="MB SPI Flash"/>
         <feature type="DIO" n="49" name="General Purpose IO on 3 x 16 pin headers, JH1-JH3, and 1 pin on JH4"/>
         <feature type="AIO" n="4" name="Analog Inputs on 4 x 2 pin headers"/>
         <feature type="SPI" n="4" name="3 x SPI Master and 1 x SPI Slave ports mapped on GPIO"/>
         <feature type="I2C" n="3" name="Up to 3 x I2C Master Ports,  1 x I2C Slave (shares same I/O as each of the master ports)"/>
         <feature type="RS232" n="4" name="1 UART, either UART0 or UART1, can be connected to the USB Micro B connector (CN1) via jumpers (JP10, JP12, JP13 and JP14). RTS/CTS hardware flow control are supported via USB as well. The remaining 3 UARTS are mapped to GPIO headers."/>
         <feature type="LED" n="4" name="User LEDs"/>
         <feature type="Other" n="1" name="External Bluetooth 4.0 Low Energy transceiver with chip antenna"/>
         <feature type="GLCD" n="1" m="128.32" name="pixel graphic OLED display module. User connectable to SPI0 via jumpers"/>
         <feature type="XTAL" n="96000000"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin ARM Standard JTAG Connector (0.1 inch connector)"/>
      </board>
   </boards>

   <examples>
      <example name="ADC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/ADC">
         <description>ADC Conversion Demo</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/ADC.uvprojx"/>
            <environment name="iar" load="IAR/ADC.ewp" />
         </project>
         <attributes>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="ADC" Cvendor="Maxim"/>
            <component Cclass="Peripherals" Cgroup="Timers" Cvendor="Maxim"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <keyword>Getting Started</keyword>
            <keyword>ADC</keyword>
            <keyword>Analog</keyword>
         </attributes>
      </example>

      <example name="AES" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/AES">
         <description>Advanced Encryption Standard (AES) Demo</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/AES.uvprojx"/>
            <environment name="iar" load="IAR/AES.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="AES" Cvendor="Maxim"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>

            <keyword>Getting Started</keyword>
            <keyword>AES</keyword>
         </attributes>
      </example>

      <example name="CLKMAN_4MHz" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/CLKMAN_4MHz">
         <description>Clock management and usage of the 4MHz internal clock demo application</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/CLKMAN_4MHz.uvprojx"/>
            <environment name="iar" load="IAR/CLKMAN_4MHz.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>

            <keyword>Getting Started</keyword>
            <keyword>Clocks</keyword>
         </attributes>
      </example>

      <example name="CRC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/CRC">
         <description>Cyclic Redundancy Check Example Application</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/CRC.uvprojx"/>
            <environment name="iar" load="IAR/CRC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="CRC" Cvendor="Maxim"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>

            <keyword>Getting Started</keyword>
            <keyword>AES</keyword>
         </attributes>
      </example>

      <example name="EVK_Demo" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/EVK_Demo">
         <description>MAX32630 Evaluation Kit Default Demo Application</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/EVK_Demo.uvprojx"/>
            <environment name="iar" load="IAR/EVK_Demo.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Timers</keyword>
         </attributes>
      </example>

      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Hello_World.uvprojx"/>
            <environment name="iar" load="IAR/Hello_World.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

