saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32630.0.0.1.pdsc
      <example name="LP_Watchdog" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/LP_Watchdog">
         <description>Low Power Mode with Watchdog.</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/LP_Watchdog.uvprojx"/>
            <environment name="iar" load="IAR/LP_Watchdog.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Watchdog Timers</keyword>
         </attributes>
      </example>

      <example name="Pulse_Train" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/Pulse_Train">
         <description>Pulse Train Generation Example</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Pulse_Train.uvprojx"/>
            <environment name="iar" load="IAR/Pulse_Train.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Pulse Train"/>
            <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" />
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Pulse Train Engine</keyword>
         </attributes>
      </example>

      <example name="RTC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/RTC">
         <description>RTC example showing use of alarms and snooze features</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/RTC.uvprojx"/>
            <environment name="iar" load="IAR/RTC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="RTC"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Real-Time Clock</keyword>
         </attributes>
      </example>

      <example name="RTX_Blinky" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/RTX_Blinky">
         <description>CMSIS-RTOS Blinky</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/RTX_Blinky.uvprojx"/>
            <environment name="iar" load="IAR/RTX_Blinky.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="RTOS"/>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cbundle="ARM Compiler" Cclass="Compiler" Cgroup="Event Recorder" Cvariant="DAP"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>CMSIS-RTX</keyword>
            <keyword>RTOS</keyword>
         </attributes>
      </example>

      <example name="SPIM_MX25" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/SPIM_MX25">
         <description>SPI Master Example showing use of the on-board MX25 Flash for Storage</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SPIM_MX25.uvprojx"/>
            <environment name="iar" load="IAR/SPIM_MX25.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI Master</keyword>
         </attributes>
      </example>

<!--       <example name="SPIS" doc="IAR/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/SPIS">
         <description>SPI Slave Example showing use of the SPI Slave loopback from the SPI Master</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPIS.ewp"/>
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="SPI Slave"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI XiP</keyword>
         </attributes>
      </example> -->

      <example name="SPIX_MX25" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/SPIX_MX25">
         <description>SPI XIP Example showing use of the on-board MX25 Flash for Execution</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SPIX_MX25.uvprojx"/>
            <environment name="iar" load="IAR/SPIX_MX25.ewp"/>
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="SPI XIP"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>External Memory</keyword>
            <keyword>SPI XiP</keyword>
         </attributes>
      </example>

      <example name="SysTick" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/SysTick">
         <description>System Tick LED Demo</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SysTick.uvprojx"/>
            <environment name="iar" load="IAR/SysTick.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="Timer" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32630_EVKIT/Timer">
         <description>32/16-bit Timer Demo</description>
         <board name="MAX32630_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Timer.uvprojx"/>
            <environment name="iar" load="IAR/Timer.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32630 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE" Cversion="4.3.0"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="HAL" Cgroup="Hardware Access Layer"/>
            <component Cclass="Peripherals" Cgroup="GPIO"/>
            <component Cclass="Peripherals" Cgroup="Timers"/>
            <component Cclass="Communications" Cgroup="SPI Master"/>
            <component Cclass="Communications" Cgroup="I2C Master"/>
            <component Cclass="Communications" Cgroup="UART"/>
            <component Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Timers</keyword>
         </attributes>
      </example>

