saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32630.0.0.1.pdsc
      <component Cclass="Communications" Cgroup="SPI Master" Cversion="0.2.7-b" condition="MAX32630 CMSIS SPI Master">
         <description>SPI Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/spim.c" version="0.2.7-b"/>
         </files>
      </component>

<!--       <component Cclass="Communications" Cgroup="SPI Slave" Cversion="0.2.7-b" condition="MAX32630 CMSIS SPI Slave">
         <description>SPI Slave Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/spis.c" version="0.2.7-b"/>
         </files>
      </component> -->

      <component Cclass="Communications" Cgroup="SPI XIP" Cversion="0.2.7-b" condition="MAX32630 CMSIS SPI XIP">
         <description>SPI eXecute In Place (XIP) Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/spix.c" version="0.2.7-b"/>
         </files>
      </component>
<!--       <component Cclass="Trust Protection Unit" Cgroup="MAA" Cversion="0.2.7-b" condition="MAX32631 CMSIS MAA">
         <description>MAA Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/maa.c" version="0.2.7-b"/>
         </files>
      </component>
 -->
      <component Cclass="Communications" Cgroup="1-Wire Master" Cversion="0.2.7-b" condition="MAX32630 CMSIS 1-Wire">
         <description>1-Wire Master Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/owm.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="PMU" Cversion="0.2.7-b" condition="MAX32630 CMSIS PMU">
         <description>Peripheral Management Unit(PMU) for DMA</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/pmu.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Pulse Train" Cversion="0.2.7-b" condition="MAX32630 CMSIS Pulse Train">
         <description>Pulse Train (PWM) Controller</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/pt.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="RTC" Cversion="0.2.7-b" condition="MAX32630 CMSIS RTC">
         <description>Real Time Clock Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/rtc.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Flash IAP" Cversion="0.2.7-b" condition="MAX32630 CMSIS Flash IAP">
         <description>Flash In-Application Programming Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/flc.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="Timers" Cversion="0.2.7-b" condition="MAX32630 CMSIS TIMER">
         <description>32/16 Bit Timers</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/tmr.c" version="0.2.7-b"/>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/tmr_utils.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT1" Cversion="0.2.7-b" condition="MAX32630 CMSIS WDT1">
         <description>Watchdog Timer 1</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/wdt.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Peripherals" Cgroup="WDT" Csub="WDT2" Cversion="0.2.7-b" condition="MAX32630 CMSIS WDT2">
         <description>Watchdog Timer 2</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/wdt2.c" version="0.2.7-b"/>
         </files>
      </component>

      <component Cclass="Communications" Cgroup="UART" Cversion="0.2.7-b" condition="MAX32630 CMSIS UART">
         <description>UART Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX3263XPeriphDriver/Source/uart.c" version="0.2.7-b"/>
         </files>
      </component>

      <bundle Cbundle="MAX32630 EVKIT Board Support" Cclass="BSP" Cversion="0.2.7-b">
         <description>MAX32630 Evaluation Kit Board Support Package</description>
         <doc>Documents/MAX32630_EVKIT_Datasheet.pdf</doc>
         <component Cgroup="Board Support" condition="MAX32630 BSP">
            <description>MAX32630 Evaluation Kit Board Setup</description>
            <files>
               <file category="doc" name="Documents/MAX32630_EVKIT_Datasheet.pdf"/>
               <file category="include" name="Boards/Maxim/MAX32630_EVKIT/Common/EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32630_EVKIT/Common/Include/"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/EvKit_V1/Source/board.c" version="0.2.7-b"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/Source/stdio.c" version="0.2.7-b"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/Source/nhd12832.c" version="0.2.7-b"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/Source/pb.c" version="0.2.7-b"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/Source/led.c" version="0.2.7-b"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/Source/max14690.c" version="0.2.7-b"/>
               <file category="sourceC" name="Boards/Maxim/MAX32630_EVKIT/Common/Source/mx25.c" version="0.2.7-b"/>
           </files>
         </component>
      </bundle>

      <bundle Cbundle="MAXUSB Libraries" Cclass="MAXUSB" Cversion="0.2.7-b">
         <description>MAXUSB Libraries for the Maxim Integrated ARM Cortex Family of Microcontrollers</description>
         <doc>Documents/MAX32630_EVKIT_Datasheet.pdf</doc>
         <component Cgroup="MAXUSB" condition="Maxim USB">
            <description>Maxim Integrated USB libraries for the ARM Cortex.</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/"/>
               <file category="include" name="Libraries/MAXUSB/include/core/"/>
               <file category="include" name="Libraries/MAXUSB/include/devclass/"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/"/>
               <file category="include" name="Libraries/MAXUSB/include/core/arm/"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/arm/usb.c"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/fifo.c"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c"/>
            </files>
         </component>
      </bundle>

   </components>

</package>
